Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public virtual void Append(
	CurveByPoints item
)
  Visual Basic
Public Overridable Sub Append ( _
	item As CurveByPoints _
)
  Visual C++
public:
virtual void Append(
	CurveByPoints^ item
)
 Parameters
  item
 Type:  Autodesk.Revit.DB CurveByPoints
 See Also
  CurveByPointsArray Class
  Autodesk.Revit.DB Namespace